<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\School;

class SchoolsTableSeeder extends Seeder
{
  /**
   * Run the database seeds.
   *
   * @return void
   */
  public function run()
  {
    $schools = [
      '조선대학교',
      '도교조선중고급학교',
      '도꾜조선제1초중급학교(유)',
      '도꾜조선제2초급학교(유)',
      '도꾜조선제3초급학교',
      '도꾜조선제4초중급학교(유)',
      '도꼬조선제5초중급학교',
      '도꾜조선제6초급학교(유)',
      '도꾜조선제9초급학교',
      '가나가와조선중고급학교',
      '요꼬하마조선초급학교(유)',
      '가와사끼조선초급학교(유)',
      '남부조선초급학교(유)',
      '니시도꾜조선제1초중급학교(유)',
      '니시도꾜조선제2초중급학교(유)',
      '지바조선초중급학교',
      '사이다마조선초중급학교(유)',
      '이바라기조선초중고급학교',
      '군마조선초중급학교',
      '도찌기조선초중급학교',
      '혹가이도조선초중고급학교',
      '도호꾸조선초중급학교',
      '후꾸시마조선초중급학교',
      '나가노조선초중급학교(유)',
      '호꾸리꾸조선초중급학교',
      '니이가따조선초중급학교',
      '아이찌조선중고급학교',
      '도슌조선초급학교(유)',
      '도요하시조선초급학교(유)',
      '나고야조선초급학교(유)',
      '아이찌조선제7초급학교(유)',
      '기후조선초중급학교(유)',
      '시즈오까조선초중급학교',
      '욕까이찌조선초중급학교(유)',
      '오사까조선중고급학교',
      '나까오사까조선초급학교(유)',
      '기따오사까조선초중급학교(유)',
      '미나미오사까조선초급학교(유)',
      '이꾸노조선초급학교(유)',
      '히가시오사까조선초급학교(유)',
      '오사까조선제4초급학교(유)',
      '죠호꾸조선초급학교(유)',
      '오사까후꾸시마조선초급학교(유)',
      '고베조선고급학교',
      '아마가사끼조선초중급학교(유)',
      '니시고베조선초급학교(유)',
      '고베조선초중급학교(유)',
      '세이방조선초중급학교(유)',
      '이따미조선초급학교(유)',
      '교또조선중고급학교',
      '교또조선초급학교(유)',
      '교또조선제2초급학교(유)',
      '시가조선초급학교(유)',
      '나라조선유치원',
      '와까야마조선초중급학교(유)',
      '히로시마조선초중고급학교(유)',
      '야마구찌조선초중급학교(유)',
      '오까야마조선초중급학교(유)',
      '시고꾸조선초중급학교',
      '규슈조선중고급학교',
      '기따규슈조선초급학교(유)',
      '후꾸오까조선초급학교(유)',
      '고꾸라유치원',
      '교직동중앙',
      '학우서방',
      '교육국',
    ];

    foreach ($schools as $name) {

      $school = new School();
      $school->name = $name;
      $school->save();
    }
  }
}